README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-03 Thu 18:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>IAM Client</title>
<meta name="author" content="Revision by: Sergio-Feliciano Mendoza-Barrera" />
<meta name="description" content="Description" />
<meta name="keywords" content="R, data science, research, methodology, julia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://cdn.globallabs.org/org-html-themes/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://cdn.globallabs.org/org-html-themes/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://cdn.globallabs.org/org-html-themes/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">IAM Client</h1>
<div class="abstract" id="orgfe3c497">
<p>
<i>IAM client in Java.</i> The <a href="https://github.com/Bizland-Factory/iam-client">GitHub repository is here</a>.
</p>

</div>

<div id="outline-container-table-of-content" class="outline-2">
<h2 id="table-of-content"><span class="section-number-2">1.</span> Table of content</h2>
<div class="outline-text-2" id="text-table-of-content">
<ul class="org-ul">
<li><i>Introduction</i></li>
<li><i>Configure IAM-Client</i></li>
<li><i>How to run IAM-Client service</i></li>
<li><i>Functionalities</i></li>
</ul>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">2.</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
</div>

<div id="outline-container-iam-client-service-motivation" class="outline-3">
<h3 id="iam-client-service-motivation"><span class="section-number-3">2.1.</span> IAM-Client service motivation</h3>
<div class="outline-text-3" id="text-iam-client-service-motivation">
<p>
IAM-Client service is an IAM's client side application used to generate IAM login url using the client certificates. and its main motivation is to ease the intgration process to IAM service.
</p>
</div>
</div>

<div id="outline-container-technologies" class="outline-3">
<h3 id="technologies"><span class="section-number-3">2.2.</span> Technologies</h3>
<div class="outline-text-3" id="text-technologies">
<ul class="org-ul">
<li><code>Java 8</code></li>
<li><code>Spring boot</code></li>
<li><code>Spring web REST</code></li>
<li><code>Lombok</code></li>
<li><code>Java key store</code></li>
<li><code>Maven</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-configure-iam-client" class="outline-2">
<h2 id="configure-iam-client"><span class="section-number-2">3.</span> Configure IAM-Client</h2>
<div class="outline-text-2" id="text-configure-iam-client">
<p>
In order to use the service properly we need to fill some properties from <a href="https://github.com/Bizland-Factory/iam-client/blob/main/src/main/resources/application.properties">application.properties</a> file:
</p>
</div>

<div id="outline-container-to-build-iam-url-search-for-each-key-in-the-specified-file-and-fill-it-with-the-proper-value." class="outline-3">
<h3 id="to-build-iam-url-search-for-each-key-in-the-specified-file-and-fill-it-with-the-proper-value."><span class="section-number-3">3.1.</span> To build IAM URL, search for each key in the specified file and fill it with the proper value</h3>
<div class="outline-text-3" id="text-to-build-iam-url-search-for-each-key-in-the-specified-file-and-fill-it-with-the-proper-value.">
<p>
In the properties file the client will find a group of properties start with <code>iam.request.url</code> this group will help the client build IAM request url. Some of the values already filled the client may keep it as it is.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">property</th>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">value explain</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">host</td>
<td class="org-left"><code>iam.request.url.host</code></td>
<td class="org-left">Check if the client is using</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">the staging or production host.</td>
</tr>

<tr>
<td class="org-left">client-id</td>
<td class="org-left"><code>iam.request.url.client-id</code></td>
<td class="org-left">it is the <i>reference number</i></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">giving to the client.</td>
</tr>

<tr>
<td class="org-left">redirect-uri</td>
<td class="org-left"><code>iam.request.url.redirect-uri</code></td>
<td class="org-left"><i>redirect-uri is a static</i></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">please use the submitted redirect-uri to</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">the NIC <b>without queries or extra path</b>.</td>
</tr>
</tbody>
</table>

<p>
<b>NOTE:</b> <i>for Production please use the following host:</i> <a href="https://iam.elm.sa/authservice/authorize">https://iam.elm.sa/authservice/authorize</a>
</p>

<p>
<b>NOTE:</b> <i>for Staging please use the following host:</i> <a href="https://iambeta.elm.sa/authservice/authorize">https://iambeta.elm.sa/authservice/authorize</a>
</p>

<p>
Another group will start with <code>jks.store</code> this group will help the client refereing to the key store
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">property</th>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">value explain</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">path</td>
<td class="org-left"><code>jks.store.path</code></td>
<td class="org-left">the full system path to the key store .</td>
</tr>

<tr>
<td class="org-left">pass</td>
<td class="org-left"><code>jks.store.pass</code></td>
<td class="org-left">provide the password for the key store.</td>
</tr>

<tr>
<td class="org-left">store-type</td>
<td class="org-left"><code>jks.store.store-type</code></td>
<td class="org-left">specify the key store type. (e.g. JKS)</td>
</tr>
</tbody>
</table>

<p>
lastly the client is going to refer to the certificates, the last group of properties will start with <code>certificate.client</code>, which will help to fetch certificate from the configured key store.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">property</th>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">value explain</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">private.alias</td>
<td class="org-left"><code>certificate.client.private.alias</code></td>
<td class="org-left">refer to the private key alias</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">that giving to the certificate</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">once imported to the key store.</td>
</tr>

<tr>
<td class="org-left">private.password</td>
<td class="org-left"><code>certificate.client.private.password</code></td>
<td class="org-left">refer to the private key's</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">password of the certificate.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>certificate.client.public.alias</code></td>
<td class="org-left">refer to the public key alias</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">that giving to the certificate</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">once imported to the key store.</td>
</tr>

<tr>
<td class="org-left">public.password</td>
<td class="org-left"><code>certificate.client.public.password</code></td>
<td class="org-left">refer to the private key's</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">password of the certificate</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>if exists</i>.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-once-you-fill-the-previous-key-value-pairs-you-are-ready-to-run-the-application." class="outline-3">
<h3 id="once-you-fill-the-previous-key-value-pairs-you-are-ready-to-run-the-application."><span class="section-number-3">3.2.</span> Once you fill the previous key value pairs you are ready to run the application</h3>
<div class="outline-text-3" id="text-once-you-fill-the-previous-key-value-pairs-you-are-ready-to-run-the-application.">
<p>
In the following section you will know how to generate IAM url and how to validate it.
</p>
</div>
</div>
</div>

<div id="outline-container-how-to-run-iam-client-service" class="outline-2">
<h2 id="how-to-run-iam-client-service"><span class="section-number-2">4.</span> How to run IAM-Client service</h2>
<div class="outline-text-2" id="text-how-to-run-iam-client-service">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=W2Ccvpt4C3A&amp;ab_channel=EduonixLearningSolutions">Linux remote server</a></li>
<li>TO-DO</li>
</ul>
</div>
</div>

<div id="outline-container-functionalities" class="outline-2">
<h2 id="functionalities"><span class="section-number-2">5.</span> Functionalities</h2>
<div class="outline-text-2" id="text-functionalities">
<p>
IAM-Client service exposes the following rest endpoints:
</p>
</div>

<div id="outline-container-generate-iam-url" class="outline-3">
<h3 id="generate-iam-url"><span class="section-number-3">5.1.</span> Generate IAM url</h3>
<div class="outline-text-3" id="text-generate-iam-url">
<p>
The client can directly generate login url by hitting the rest endpoint:
</p>

<blockquote>
<p>
GET <a href="http://localhost:8088/url">http://localhost:8088/url</a>
</p>
</blockquote>

<p>
and it will return back login url as string and you may use it to test.
</p>

<p>
<b>NOTE:</b> <i>In order to access IAM servers the client server need to be
configured in the NIC.</i>
</p>
</div>
</div>

<div id="outline-container-validate-iam-url" class="outline-3">
<h3 id="validate-iam-url"><span class="section-number-3">5.2.</span> Validate IAM url</h3>
<div class="outline-text-3" id="text-validate-iam-url">
<p>
The client may validate login url by hitting the rest endpoint:
</p>

<pre class="example" id="org232918b">
POST http://localhost:8088/url
</pre>

<pre class="example" id="org2e9e1ee">
@RequestBody
{"url":"https://iambeta.elm.sa/authservice/authorize?..."}
</pre>

<p>
and it will return back validation response with <code>HTTP_STATUS 200</code> if it is valid, and with <code>HTTP_STATUS 422</code> with error description if it is invalid login url.
</p>
</div>
</div>
</div>

<div id="outline-container-org6454ad5" class="outline-2">
<h2 id="org6454ad5"><span class="section-number-2">6.</span> Extra documentation</h2>
<div class="outline-text-2" id="text-6">
<p>
The following pages are documents related to the IAM, NIC and ELM services.
</p>

<p>
EOF
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: \today</p>
<p class="author">Author: Revision by: Sergio-Feliciano Mendoza-Barrera</p>
<p class="date">Created: 2022-02-03 Thu 18:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
